app/controllers/submitions_controller.rb

SELECT "submitions".* FROM "submitions"
---
  def index
    @submitions = Submition.all

INSERT INTO "submitions" ("Atividade", "Arquivo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Atividade", "Teste"], ["Arquivo", "bootstrap-login-form-1.jpg"], ["created_at", 2017-03-28 13:48:48 UTC], ["updated_at", 2017-03-28 13:48:48 UTC]]
---
  def create
    @submition = Submition.new(submition_params)

    #save file no server paste
    uploaded_io = params[:submition][:Arquivo]
    File.open(Rails.root.join('public','uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
    end
    @submition.Arquivo=uploaded_io.original_filename

    respond_to do |format|
      if @submition.save

UPDATE "submitions" SET "Arquivo" = ?, "updated_at" = ? WHERE "submitions"."id" = ?  [["Arquivo", "#<ActionDispatch::Http::UploadedFile:0x007f9a348a90f0>"], ["updated_at", 2017-03-29 12:38:11 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @submition.update(submition_params)

DELETE FROM "submitions" WHERE "submitions"."id" = ?  [["id", 1]]
---
  def destroy
    @submition.destroy

SELECT  "submitions".* FROM "submitions" WHERE "submitions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_submition
      @submition = Submition.find(params[:id])